export const lessons = [
  {
    id: 1,
    title: "البرنامج 1",
    subtitle: "قراءة",
    status: "قيد التقدم",
    description:
      "تحسين مهارات النطق والتلاوة. يتعلم الطلاب كيفية قراءة النصوص بشكل صحيح، مع التركيز على التجويد والتعبير الصوتي.",
    progress: 10,
    isActive: true,
  },
  {
    id: 2,
    title: "البرنامج 2",
    subtitle: "قراءة",
    progress: 0,
    isActive: false,
  },
  {
    id: 3,
    title: "البرنامج 3",
    subtitle: "قراءة",
    progress: 0,
    isActive: false,
  },
  {
    id: 4,
    title: "البرنامج 4",
    subtitle: "قراءة",
    status: "قريبًا",
    progress: 0,
    isActive: false,
  },
  {
    id: 5,
    title: "البرنامج 5",
    subtitle: "قراءة",
    progress: 0,
    isActive: false,
  },
  {
    id: 6,
    title: "البرنامج 6",
    subtitle: "قراءة",
    progress: 0,
    isActive: false,
  },
]

export const stages = [
  {
    id: 1,
    title: "مرحلة 1",
    description:
      "تقع هذه المرحلة على تحليل نقطة القول والتنفيس وتعليم الطالب خطوة مرحلة لمراجعة أسبوع زمن ديناك مع التركيز على التجويد والتجويد والتواريخ القرآني.",
    lessons: [
      { id: 1, label: "الكتاب 1" },
      { id: 2, label: "الكتاب 2" },
      { id: 3, label: "الكتاب 3" },
      { id: 4, label: "الكتاب 4" },
    ],
  },
  {
    id: 2,
    title: "مرحلة 2",
    description:
      "تقع هذه المرحلة على تحليل نقطة القول والتنفيس وتعليم الطالب خطوة مرحلة لمراجعة أسبوع زمن ديناك مع التركيز على التجويد والتجويد والتواريخ القرآني.",
    lessons: [
      { id: 1, label: "الكتاب 1" },
      { id: 2, label: "الكتاب 2" },
    ],
  },
  {
    id: 3,
    title: "مرحلة 3",
    description:
      "تقع هذه المرحلة على تحليل نقطة القول والتنفيس وتعليم الطالب خطوة مرحلة لمراجعة أسبوع زمن ديناك مع التركيز على التجويد والتجويد والتواريخ القرآني.",
    lessons: [],
  },
  {
    id: 4,
    title: "مرحلة 4",
    description:
      "تقع هذه المرحلة على تحليل نقطة القول والتنفيس وتعليم الطالب خطوة مرحلة لمراجعة أسبوع زمن ديناك مع التركيز على التجويد والتجويد والتواريخ القرآني.",
    lessons: [],
  },
  {
    id: 5,
    title: "مرحلة 5",
    description:
      "تقع هذه المرحلة على تحليل نقطة القول والتنفيس وتعليم الطالب خطوة مرحلة لمراجعة أسبوع زمن ديناك مع التركيز على التجويد والتجويد والتواريخ القرآني.",
    lessons: [],
  },
]

export const books = [
  {
    id: 1,
    title: "كتاب رقم 1: مدخل إلى علم التجويد",
    description:
      "يركز هذا الكتاب على تحسين مهارات النطق والتلاوة، مع شرح مبسط لقواعد التجويد والتعبير الصوتي.",
    courses: [
      { id: 1, title: "عنوان المقرر الأول" },
      { id: 2, title: "عنوان المقرر الثاني" },
      { id: 3, title: "عنوان المقرر الثالث" },
      { id: 4, title: "عنوان المقرر الرابع" },
    ],
  },
]
